app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
---
	<%= f.label :category_ids, "Categories" %>
	<%= f.select :category_ids, Category.all.collect{|c| [c.name, c.id]}, {}, {multiple: 'multiple'} %>