app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
---
<h5>Comments:</h5>
<% @post.comments.each do |comment| %>