app/controllers/categories_controller.rb

	def create
		@category = Category.new(params[:category])

		if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 24 Jun 2013 14:30:35 EDT -04:00], ["name", "DHP"], ["updated_at", Mon, 24 Jun 2013 14:30:35 EDT -04:00]]