app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.build(params[:comment])
		@comment.user = current_user

		if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Another comment!"], ["created_at", Mon, 17 Jun 2013 13:57:19 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 17 Jun 2013 13:57:19 UTC +00:00], ["user_id", 1]]

	def vote
		#binding.pry
		#@comment = Comment.find(params[:id])
    Vote.create(voteable: @comment, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 24 Jun 2013 15:21:39 EDT -04:00], ["updated_at", Mon, 24 Jun 2013 15:21:39 EDT -04:00], ["user_id", 7], ["vote", true], ["voteable_id", nil], ["voteable_type", nil]]