app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 13 Jun 2013 14:45:34 UTC +00:00], ["description", nil], ["title", "Test 123"], ["updated_at", Thu, 13 Jun 2013 14:45:34 UTC +00:00], ["url", "another test"], ["user_id", 1]]
---
  def create
  	# Create a post using model backed forms
  	@post = Post.new(post_params)
    @post.user = current_user

   	if @post.save

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 24 Jun 2013 13:03:49 EDT -04:00], ["updated_at", Mon, 24 Jun 2013 13:03:49 EDT -04:00], ["user_id", nil], ["vote", true], ["voteable_id", 40], ["voteable_type", "Post"]]
---
  def vote
    binding.pry
    Vote.create(voteable: @post, user: current_user, vote: params[:vote])